# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника). 

print('Введите длину шоколадки: ', end = '')
n = int(input())
print('Введите ширину шоколадки: ', end = '')
m = int(input())
print('Введите количество долек: ', end = ' ')
k = int(input())
if k % n == 0 or k % m == 0:
    print(f"{n} {m} {k} -> yes")
else:
    print(f"{n} {m} {k} -> no")